In [2]:
import pandas as pd

import numpy as np

import pandas as pd
import multiprocessing
import pickle

In [3]:
base_path = './data'
feature_path = './feature'

In [24]:
t = ['1','2','3']

In [25]:
'_'.join(t)

'1_2_3'

In [4]:
a = pd.DataFrame({'c1': [1,2,3,4,4]})

In [5]:
a.loc[a['c1']==4, 'c2'] = 0

In [6]:
a

   c1   c2
0   1  NaN
1   2  NaN
2   3  NaN
3   4  0.0
4   4  0.0

In [9]:
a

   c1   c2
0   1  NaN
1   2  NaN
2   3  NaN
3   4  0.0
4   4  0.0

In [10]:
b = pd.DataFrame({'c1': [15,25,35,45,45]})

In [11]:
c = pd.concat([a,b], axis=1)

In [12]:
c

   c1   c2  c1
0   1  NaN  15
1   2  NaN  25
2   3  NaN  35
3   4  0.0  45
4   4  0.0  45

In [8]:
len(a['c2'])

5